/*!
@file EffectUpdateDrawManager.h
@brief エフェクトの更新と描画を行うクラス
*/

#pragma once
#include "stdafx.h"

namespace basecross
{
	class EffectUpdateDrawManager : public GameObject
	{
	//--------------------------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------------------------
	private:
		ManagerRef m_manager;
		RendererRef m_renderer;
	//--------------------------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------------------------
	private:
		//----------------------------------------------------------------------------------
		/*
			ビューと射影行列を設定する
			@param view	ビュー行列
			@param proj	射影行列
			@return	なし
		*/
		void SetViewProj(const Mat4x4& view, const Mat4x4& proj);
		//----------------------------------------------------------------------------------
		/*
			Mat4x4をMatrix4x4に変換する
			@param sec 変換元
			@param dest 変換先
			@return	なし
		*/
		void Mat4x4ToMatrix44(const Mat4x4& src, Matrix44& dest);
	public:
		//----------------------------------------------------------------------------------
		/*
			コンストラクタ
		*/
		EffectUpdateDrawManager
		(
			const shared_ptr<Stage>& StagePtr
		);
		//----------------------------------------------------------------------------------
		/*
			デストラクタ
		*/
		virtual ~EffectUpdateDrawManager();
		//----------------------------------------------------------------------------------
		/*
			初期化設定
		*/
		virtual void OnCreate() override;
		//----------------------------------------------------------------------------------
		/*
			更新処理
		*/
		virtual void OnUpdate() override;
		//----------------------------------------------------------------------------------
		/*
			描画処理
		*/
		virtual void OnDraw() override;
	};
}